# SQL for Analytics (with Python)
Learn SQL using Python's `sqlite3` library and `pandas`. We will create a temporary database in memory.

In [ ]:
import sqlite3
import pandas as pd

# Create an in-memory SQLite database connection
conn = sqlite3.connect(':memory:')

## Creating Tables

In [ ]:
# Create a cursor object
cursor = conn.cursor()

# Create a table
cursor.execute('''
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    department TEXT,
    salary INTEGER
)
''')
conn.commit()

## Inserting Data

In [ ]:
employees = [
    (1, 'Alice', 'Engineering', 80000),
    (2, 'Bob', 'HR', 50000),
    (3, 'Charlie', 'Engineering', 85000),
    (4, 'David', 'Marketing', 60000),
    (5, 'Eve', 'HR', 55000)
]
cursor.executemany('INSERT INTO employees VALUES (?, ?, ?, ?)', employees)
conn.commit()

## Querying Data (SELECT)

In [ ]:
pd.read_sql_query('SELECT * FROM employees', conn)

## Filtering (WHERE)

In [ ]:
pd.read_sql_query('SELECT * FROM employees WHERE department = "Engineering"', conn)

## Aggregation (GROUP BY)

In [ ]:
pd.read_sql_query('''
SELECT department, AVG(salary) as average_salary 
FROM employees 
GROUP BY department
''', conn)

## Joining Tables

In [ ]:
# Create another table
cursor.execute('''
CREATE TABLE departments (
    name TEXT,
    location TEXT
)
''')
departments = [('Engineering', 'Building A'), ('HR', 'Building B'), ('Marketing', 'Building A')]
cursor.executemany('INSERT INTO departments VALUES (?, ?)', departments)
conn.commit()

In [ ]:
# JOIN query
pd.read_sql_query('''
SELECT e.name, e.salary, d.location 
FROM employees e
JOIN departments d ON e.department = d.name
''', conn)

In [ ]:
# Close connection when done
conn.close()